Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Free – In the { -brand-name-app-store }
am: ነፃ - በ{ -brand-name-app-store } ውስጥ

source: Free Web Browser
am: ነፃ የድር አሳሽ

source: from { -brand-name-mozilla }
am: ከ{ -brand-name-mozilla }

source: From security to news to gaming, there’s an <a { $attrs }>extension for everyone</a>. Add as many as you want until your browser is just right.
am: ከደህንነት እስከ ዜና እስከ ጨዋታ፣ ለእያንዳንዱ ሰው የሚሆን <a { $attrs }>ቅጥያ</a> አለ። አሳሽዎ ፍላጎትዎን እስኪሞላ ድረስ የፈለጉትን ያህል ይጨምሩ።

source: From watching a web tutorial to keeping an eye on your favorite team, your video follows you while you multitask.
am: የድር አጋዥ ስልጠናን ከመመልከት ጀምሮ የሚወዱትን ቡድን እስከመከታተል፣ የተለያየ ሥራ በሚሰሩበት ጊዜ ተንቀሳቃሽ ምስልዎ ይከተልዎታል።

source: Get an Account
am: መለያ ያግኙ

source: Get a sneak peek at our next generation web browser, and help us make it the best browser it can be: try { -brand-name-firefox-nightly }.
am: የእኛን ቀጣዩ ትውልድ የድር አሳሽ ይመልከቱ እና እሱ ሊሆን የሚችለውን ምርጥ አሳሽ እንድናደርገው ይርዳን፡ { -brand-name-firefox-nightly }ን ይሞክሩ።

source: Get a sneak peek at the latest { -brand-name-firefox } browser features before they’re released.
am: ከመለቀቃቸው በፊት የቅርብ ጊዜውን የ{ -brand-name-firefox } አሳሽ ባህሪያትን በመጠኑ ይቃኙት።

source: Get { -brand-name-firefox }, a free web browser backed by { -brand-name-mozilla }, a non-profit dedicated to internet health and privacy. Available now on { -brand-name-windows }, { -brand-name-mac-short }, { -brand-name-linux }, { -brand-name-android } and { -brand-name-ios }.
am: { -brand-name-firefox }ን ያግኙ፣ በ{ -brand-name-mozilla } የሚደገፍ፣ ለበይነመረብ ጤና እና ግላዊነት የተሰጠ ለትርፍ ያልተቋቋመ። አሁን በ{ -brand-name-windows }፣ { -brand-name-mac-short }፣ { -brand-name-linux }፣ { -brand-name-android } እና { -brand-name-ios } ላይ ይገኛል።

source: Get { -brand-name-firefox-browser } for { -brand-name-chromebook }
am: ለ{ -brand-name-chromebook } { -brand-name-firefox-browser }ን ያግኙ

source: Get { -brand-name-firefox-browser } for <strong>{ -brand-name-android }</strong>
am: ለ<strong>{ -brand-name-android }</strong> { -brand-name-firefox-browser }ን ያግኙ

source: Get { -brand-name-firefox-browser } for <strong>{ -brand-name-ios }</strong>
am: ለ<strong>{ -brand-name-ios }</strong> { -brand-name-firefox-browser } ያግኙ

source: Get { -brand-name-firefox } Desktop for { -brand-name-chromebook }
am: ለ{ -brand-name-chromebook } የ{ -brand-name-firefox } ዴስክቶፕን ያግኙ

source: Get { -brand-name-firefox-focus }
am: { -brand-name-firefox-focus }ን ያግኙ

source: Get { -brand-name-firefox } for { -brand-name-android }
am: ለ{ -brand-name-android } { -brand-name-firefox }ን ያግኙ

source: Get { -brand-name-firefox } for { -brand-name-chromebook }
am: ለ{ -brand-name-chromebook } { -brand-name-firefox }ን ያግኙ

source: Get { -brand-name-firefox } for { -brand-name-ios }
am: ለ { -brand-name-ios } { -brand-name-firefox }ን ያግኙ

source: Get { -brand-name-firefox } for { -brand-name-windows }, { -brand-name-mac-short } or { -brand-name-linux }. { -brand-name-firefox } is a free web browser backed by { -brand-name-mozilla }, a non-profit dedicated to internet health and privacy.
am: ለ{ -brand-name-windows }፣ { -brand-name-mac-short } ወይም { -brand-name-linux } { -brand-name-firefox }ን ያግኙ። { -brand-name-firefox } በ{ -brand-name-mozilla } የተደገፈ ነፃ የድር አሳሽ ነው፣ ለትርፍ ያልተቋቋመ ለበይነመረብ ጤና እና ግላዊነት።

source: Get { -brand-name-firefox } for mobile
am: ለሞባይል { -brand-name-firefox }ን ያግኙ

source: Get { -brand-name-firefox } for your enterprise
am: ለድርጅትዎ { -brand-name-firefox }ን ያግኙ

source: Get { -brand-name-firefox } for your enterprise with { -brand-name-esr } and Rapid Release
am: ለድርጅትዎ { -brand-name-firefox }ን በ{ -brand-name-esr } እና ፈጣን ልቀትን ያግኙ

source: Get Enhanced Tracking Protection and make { -brand-name-firefox } your default, go-to, forever browser on your { -brand-name-iphone } and { -brand-name-ipad }.
am: የተሻሻለ የክትትል ጥበቃን ያግኙ እና { -brand-name-firefox }ን በእርስዎ { -brand-name-iphone } እና { -brand-name-ipad } ላይ በዘላቂነት ነባሪ አሳሽ ያድርጉት።

source: Get help
am: እርዳታ ያግኙ

source: Get it on { -brand-name-google-play }
am: በ{ -brand-name-google-play } ላይ ያግኙት

source: Get more { -brand-name-firefox } in your life
am: በህይወትዎ ውስጥ ተጨማሪ { -brand-name-firefox } ያግኙ

source: Get speed and security. { -brand-name-firefox } is fast on { -brand-name-mac-short } because we don’t track your moves.
am: ፍጥነት እና ደህንነት ያግኙ። { -brand-name-firefox } በ{ -brand-name-mac-short } ላይ ፈጣን ነው ምክንያቱም እንቅስቃሴዎን አንከታተልም።

source: Get the browser that protects what’s important
am: አስፈላጊ የሆነውን የሚጠብቅ አሳሽ ያግኙ

source: Get the browser that puts your privacy first — and <strong>always</strong> has
am: የእርስዎን ግላዊነት የሚያስቀድመውን አሳሽ ያግኙ - እና <strong>ሁልጊዜ</strong>ያለው

source: Get the latest { -brand-name-firefox } browser.
am: የቅርብ ጊዜውን { -brand-name-firefox } አሳሽ ያግኙ።

source: Get to the parts of the internet you care about faster. Choose to see all your open tabs, recent searches, bookmarks and favorite sites all in one place.
am: ወደሚፈልጉት የበይነ-መረብ ክፍሎች በፍጥነት ይድረሱ። ሁሉንም ክፍት ትሮችዎን፣ የቅርብ ጊዜ ፍለጋዎችዎን፣ እልባቶችዎን እና ተወዳጅ ድረ-ገፆችዎን ሁሉንም በአንድ ቦታ ለማየት ይምረጡ።

source: Get tough with Strict mode
am: በጥብቅ ሁኔታ ጠንካራ ይሁኑ

source: Get to your go-to places faster on your { -brand-name-iphone } and { -brand-name-ipad }
am: በእርስዎ { -brand-name-iphone } እና { -brand-name-ipad } ላይ የሚሄዱባቸውን ቦታዎች በፍጥነት ያግኙ

source: Get unmatched data protection with support cycles tailored to suit your company’s needs.
am: ከኩባንያዎ ፍላጎት ጋር የተጣጣመ ወደር የለሽ የውሂብ ጥበቃ ከድጋፍ ዑደቶች ጋር ያግኙ።

source: Go Back
am: ወደኋላ ተመለስ

source: Go easy with Standard mode
am: በመደበኛ ሁነታ በቀላሉ ይሂዱ

source: Go from light mode to dark mode depending on your mood or preference, or liven things up with a custom theme (rainbow unicorn, perhaps).
am: እንደ ስሜትህ ወይም ምርጫህ ከብርሃን ሁነታ ወደ ጨለማ ሁነታ ሂድ፣ ወይም ነገሮችን በብጁ ጭብጥ (ቀስተ ደመና ዩኒኮርን፣ ምናልባት) አሳምር።

source: Go your own way with { -brand-name-firefox } mobile
am: በተንቀሳቃሽ ስልክ { -brand-name-firefox } በራስዎ መንገድ ይጠቀሙ

source: Grab a high-resolution image of anything online with our <a { $attrs }>screenshot</a> tool built right in the browser
am: በቀጥታ በአሳሹ ውስጥ በተሰራው የእኛ <a { $attrs }>ቅጽበታዊ ገጽ እይታ</a> መሳሪያ የማንኛውንም ነገር ከፍተኛ ጥራት ያለው ምስል ያንሱ

source: Having trouble?
am: ችግር እያጋጠመዎት ነው?

source: Having trouble? <a { $attrs }>Get help with your installation</a>.
am: ችግር እያጋጠመዎት ነው? <a { $attrs }>እንዴት እንደሚጫን እገዛ ያግኙ</a>።

source: Having trouble setting your default browser?
am: ነባሪ አሳሽዎን ማዋቀር ላይ ችግር እያጋጠመዎት ነው?

source: Here’s everything you need to know about setting your default browser on <a href="{ $android }">Android devices</a>.
am: ነባሪ አሳሽዎን በ<a href="{ $android }">አንድሮይድ መሳሪያዎች</a> ላይ ስለማዘጋጀት ማወቅ ያለብዎት ሁሉም ነገር ይኸውና።

source: Here’s everything you need to know about setting your default browser on <a href="{ $android }">Android devices</a> or <a href="{ $desktop }">desktop computers</a>.
am: ነባሪ አሳሽዎን በ<a href="{ $android }">አንድሮይድ መሳሪያዎች</a> ወይም <a href="{ $desktop }">ዴስክቶፕ ኮምፒውተሮች</a> ላይ ስለማዘጋጀት ማወቅ ያለብዎት ሁሉም ነገር ይኸውና።

source: Here’s everything you need to know about setting your default browser on <a href="{ $ios }">iOS devices</a>.
am: ነባሪ አሳሽዎን በ<a href="{ $ios }">iOS መሳሪያዎች</a> ላይ ስለማዘጋጀት ማወቅ ያለብዎት ሁሉም ነገር ይኸውና።

source: Hide All
am: ሁሉንም ደብቅ

source: How does a web browser work?
am: የድር አሳሽ እንዴት ነው የሚሰራው?

source: How do I get the { -brand-name-firefox-browser }?
am: { -brand-name-firefox-browser }ን እንዴት ማግኘት እችላለሁ?

source: How do you get 64-bit { -brand-name-firefox }?
am: 64-ቢት { -brand-name-firefox }ን እንዴት ማግኘት ይቻላል?

source: How to choose the best browser for you.
am: እንዴት ነው የተሻለ ድረ-ገፅ ማሰሻን መምረጥ የሚችሉት።

source: How to stop seeing too many ads and keep companies from following you around online. An ad blocker guide from the { -brand-name-firefox } web browser.
am: እንዴት ነው ብዙ ማስታወቂያዎችን ከማየት ማስቆም እና ካምፓኒዎች በመስመር ላይ የእርስዎን ዱካ እንዳይከተሉ ማድረግ የሚችሉት። የማስታወቂያ ማገጃ መመሪያ ከ{ -brand-name-firefox } ድረ-ገፅ ማሰሻ ላይ ያንብቡ።

source: If you’re wondering what it means to have a private or fast browser, here’s a breakdown of three things a browser should have.
am: ፈጣን እና አስተማማኝ የድረ-ገፅ ማሰሻ ምን ማለት እንደሆነ ለማወቅ ከጓጉ፤ አንድ የድረ-ገፅ ማሰሻ ማሟላት ያለበት ሶስት ነገሮች ይኸውልዎት።

source: If you see a prompt stating the app you’re trying to install isn’t a { -brand-name-microsoft }-verified app, click “Install anyway” or <a { $attrs }>change app recommendation settings</a>.
am: ለመጫን እየሞከሩት ያለው መተግበሪያ በ{ -brand-name-microsoft } የተረጋገጠ መተግበሪያ አለመሆኑን የሚገልጽ ማሳወቂያ ካዩ፣ “ለማንኛውም ጫን” ን ጠቅ ያድርጉ ወይም <a { $attrs }>የመተግበሪያ ምክር ቅንብሮችን ይቀይሩ</a >።

source: Inactive CSS
am: የቦዘነ CSS

source: In a short period of time, we’ve gone from being amazed by the ability to send an email to someone around the world, to a change in how we think about information.
am: በአጭር ጊዜ ውስጥ፣ በአለም ዙሪያ ላለ ሰው ኢሜይል በመላክ ችሎታ ከመደነቅ አልፎ ስለመረጃ የምናስብበት መንገድ ለወጥ ድረስ ሄድን።

source: Individual protections report
am: የግለሰብ ጥበቃ ሪፖርት

source: Infinitely customizable, private and secure, { -brand-name-firefox } for { -brand-name-android } is a lightning-fast browser that will never sell you out.
am: ወሰን በሌለው ሊበጅ የሚችል፣ ግላዊ እና ደህንነቱ የተጠበቀ፣ { -brand-name-firefox } ለ{ -brand-name-android } በጭራሽ መረጃዎን የማይሸጥ እንደመብረቅ ፈጣን አሳሽ ነው።

source: Innovative Features
am: የፈጠራ ባህሪያት

source: Inspect and refine code to build pixel-perfect layouts.
am: ፒክሰል-ስምም አቀማመጦችን ለመገንባት ኮድን መርምር እና አጥራ።

source: Inspector
am: መርማሪ

source: Install { -brand-name-firefox } as a { -brand-name-linux } app: going this route takes a few more steps, but it’s worth it. When you install the { -brand-name-firefox } browser as a { -brand-name-linux } app, you get the { -brand-name-firefox } desktop browser and all the benefits that come with, including Enhanced Tracking Protection, a built-in password manager, access to thousands of add-ons (including UBlock Origin ad blocker), and themes to customize the look of your browser. <a { $url }>Learn more about installing { -brand-name-firefox } desktop browser for { -brand-name-chromebook }.</a>
am: { -brand-name-firefox }ን እንደ { -brand-name-linux } መተግበሪያ ጫን፡ በዚህ መንገድ መሄድ ጥቂት ተጨማሪ እርምጃዎችን ይወስዳል፣ ግን ዋጋ ያለው ነው። የ{ -brand-name-firefox } አሳሹን እንደ { -brand-name-linux } መተግበሪያ ሲጭኑ የ{ -brand-name-firefox } ዴስክቶፕ አሳሽ እና የተሻሻለ የክትትል ጥበቃን ጨምሮ አብረው የሚመጡትን ጥቅማ ጥቅሞች ያገኛሉ፤ አብሮ የተሰራ የይለፍ ቃል አቀናባሪ ፣ በሺዎች የሚቆጠሩ ማከያዎች (UBlock Origin ማስታወቂያ ማገጃን ጨምሮ) እና የአሳሽዎን ገጽታ ለማበጀት የሚረዱ ገጽታዎች። <a { $url }>የ{ -brand-name-firefox } ዴስክቶፕ አሳሽ ለ{ -brand-name-chromebook } ስለመጫን የበለጠ ይወቁ።</a>

source: Install { -brand-name-firefox } from { -brand-name-google-play } Store: on newer versions of { -brand-name-chromeos } (x86 based { -brand-name-chromebook } running { -brand-name-chromeos } 80 or later), you have the option to install the { -brand-name-firefox } for { -brand-name-android } app. This app is developed for mobile devices.
am: { -brand-name-firefox }ን ከ{ -brand-name-google-play } ማከማቻ ጫን፡ በአዲሶቹ የ{ -brand-name-chromeos } (x86 ላይ የተመሰረተ { -brand-name-chromebook }{ -brand-name-chromeos } 80 ወይም በሁዋላ)፣ ለ{ -brand-name-android } መተግበሪያ{ -brand-name-firefox }ን የመጫን አማራጭ አለህ። ይህ መተግበሪያ ለተንቀሳቃሽ ስልኮች የተሰራ ነው።

source: In the mid-nineties, { -brand-name-netscape }, { -brand-name-ie } and AOL dominated the landscape. It was a simpler time when the sweet melody of dial-up internet rang across the land. You learned the meaning of patience waiting for web pages to load. Back then, all that mattered was browser speed.
am: በዘጠናዎቹ አጋማሽ { -brand-name-netscape }፣ { -brand-name-ie } እና አሜሪካ ኦንላይን ዘርፉን ተቆጣጠሩ። በወቅቱም ባጠቃላይ በምድሪቱ ላይ ተስፋፍቶ የነበረው ባለ-ገመድ የበይነበረብ አገልግሎት ነበር። ታዲያ የሚፈልጉት ድረ-ገጾች እንዲጫኑ መጠበቅ የትዕግስትን ትርጉም አስተምሯል። ያኔ፣ ዋናው ነገር የአሳሽ ፍጥነት ነበር።

source: Is { -brand-name-chrome } better than { -brand-name-firefox }?
am: { -brand-name-chrome } ከ{ -brand-name-firefox } ይሻላል?

source: Is { -brand-name-firefox } { -brand-name-chromium } based?
am: { -brand-name-firefox } { -brand-name-chromium } ላይ የተመሰረተ ነው?

source: Is { -brand-name-firefox } free?
am: { -brand-name-firefox } ነፃ ነው?

source: Is { -brand-name-firefox } safe?
am: { -brand-name-firefox } ደህንነቱ የተጠበቀ ነው?

source: Is { -brand-name-firefox } safe to download?
am: { -brand-name-firefox } ለማውረድ ደህንነቱ የተጠበቀ ነው?

source: Is it hard to install { -brand-name-firefox } for { -brand-name-chromebook }?
am: { -brand-name-firefox }ን ለ{ -brand-name-chromebook } መጫን ከባድ ነው?

source: It’s probably just a server error and we’re working to fix it.
am: ምናልባት የአገልጋይ ስህተት ብቻ ነው እና ለማስተካከል እየሰራን ነው።

source: Join the conversation
am: ውይይቱን ይቀላቀሉ

source: Keep all your favorite browser features — and <strong>discover</strong> new ones.
am: ሁሉንም ተወዳጅ የአሳሽ ባህሪያትን ያስቀምጡ - እና አዳዲሶችን <strong>ያግኙ</strong>።

source: Last but not least, a safe browser should offer tools to help you keep an eye on your accounts. Think of alerts that go straight to your email if any of your accounts get breached or icons that tell you whether a website is encrypted, (i.e., if it’s a good idea to enter your credit number on a shopping site).
am: በመጨረሻም አስተማማኝ ድረ-ገፅ ማሰሻ ሊሰጠው የሚገባው መለያዎትን መቆጣጠር የሚያስችሉ መሳሪያዎች ነው። መለያዎት የመረጃ መጭበርበር ካጋጠመው በቀጥታ በኢሜይል ማሳወቂያ መላክ ወይም ድረ-ገፁ ህጋዊ እና የተመሰጠረ መሆኑን የሚያሳይ ምልክት መጠቀም አለበት፤ (ይህም ማለት፦ በመገበያያ ድረ-ገፆች ላይ የባንክ ሂሳብ መረጃዎችን ለመስጠት እንዲወስኑ ይረዳዎታል)።

source: Learn about { -brand-name-firefox } browsers
am: ስለ { -brand-name-firefox } የድር አሳሾች ይወቁ

source: Learn about installers
am: ሰለ ማቀናጃዎች ይወቁ

source: Learn about the { -brand-name-firefox } desktop browser below
am: ከታች ስለ { -brand-name-firefox } ዴስክቶፕ አሳሽ ይወቁ

source: Learn more
am: ተጨማሪ ይወቁ

source: Learn more about { -brand-name-firefox } browsers and products that handle your data with respect and are built for privacy anywhere you go online.
am: ውሂብዎን በአክብሮት ስለሚያስተናግዱ እና መስመር ላይ በሄዱበት በማንኛውም ቦታ ለግላዊነት ስለተገነቡ ስለ { -brand-name-firefox } አሳሾች እና ምርቶች የበለጠ ይወቁ።

source: Learn more about { -brand-name-firefox }, its history, features and mission
am: ስለ { -brand-name-firefox }፣ ታሪኩ፣ ባህሪያቱ እና ተልዕኮው የበለጠ ይወቁ

source: Learn more about Network Monitor
am: ስለአውታረ መረብ መቆጣጠሪያ የበለጠ ይወቁ

source: Learn more about Page Inspector
am: ስለገጽ መርማሪ የበለጠ ይረዱ

source: Learn more about Performance Tools
am: ስለ የአፈጻጸም መሳሪያዎች የበለጠ ይወቁ

source: Learn more about Responsive Design View
am: ስለ ምላሽ ሰጪ ንድፍ እይታ የበለጠ ይረዱ

source: Learn more about Storage Panel
am: ስለ ማከማቻ ፓነል የበለጠ ይወቁ

source: Learn more about Style Editor
am: ስለ ገፅታ አርታዒ የበለጠ ይረዱ

source: Learn more about Visual Editing
am: ስለ ምስላዊ አርትዖት የበለጠ ይወቁ

source: Learn more about Web Console
am: ስለድር ኮንሶል የበለጠ ይረዱ

source: Legacy browser support
am: የቆየ አሳሽ ድጋፍ

source: Library of extensions
am: የቅጥያዎች ቤተ-መተግበሪያ

source: Live your life, { -brand-name-firefox } isn’t watching. Choose what to share and when to share it.
am: ህይወትዎን ይኑሩ፣ { -brand-name-firefox } እየተመለከተ አይደለም። ምን እንደሚያጋሩ እና መቼ እንደሚያጋሩ ይምረጡ።

source: Looking for a streamlined, super fast mobile browser with next-level privacy features? { -brand-name-firefox-focus } automatically erases all your browsing history from the moment you open your browser to the second you close it.
am: የተስተካከለ፣ እጅግ በጣም ፈጣን የስልክ አሳሽ ከከፍተኛ ደረጃ የግላዊነት ባህሪያት ጋር ይፈልጋሉ? { -brand-name-firefox-focus } አሳሽዎን ከከፈቱበት ጊዜ አንስቶ እስከ ዘጉበት ሴኮንድ ድረስ ሁሉንም የአሰሳ ታሪክዎን በራስ ሰር ያጠፋል።

source: Looks like you’re using a different browser right now. Make sure you have { -brand-name-firefox } downloaded on your device.
am: አሁን የተለየ አሳሽ እየተጠቀሙ ያሉ ይመስላሉ። በመሳሪያዎ ላይ { -brand-name-firefox }ን ማውረድዎን ያረጋግጡ።

source: Look under the hood. Like { -brand-name-linux }, { -brand-name-firefox } features are open source.
am: ከመጋረጃው ጀርባ ይመልከቱ። እንደ { -brand-name-linux }፣ የ{ -brand-name-firefox } ልዩ ባህሪያትም ክፍት ምንጭ ናቸው።

source: Mac
am: ማክ

source: Made by { -brand-name-mozilla }
am: በ{ -brand-name-mozilla } የተሰራ

source: Make { -brand-name-firefox } your default browser
am: { -brand-name-firefox }ን ነባሪ አሳሽህ አድርግ

source: Make <strong>{ -brand-name-firefox }</strong> your own
am: <strong>{ -brand-name-firefox }</strong>ን የራስዎ ያድርጉት

source: Make sure you’re protected, every time you get online
am: መስመር ላይ በገቡ ቁጥር ፣ የተጠበቁ መሆንዎን ያረጋግጡ

source: Making your web browser work for you
am: የድር አሳሽዎን ለእርስዎ እንዲሰራ ማድረግ

source: Marshall Erwin, Senior Director of Trust and Security at { -brand-name-mozilla }
am: ማርሻል ኤርዊን፣ የታማኝነት እና ደህንነት ከፍተኛ ዳይሬክተር በ{ -brand-name-mozilla }

source: Memory
am: ማህደረ ትውስታ

source: Menu
am: ምናሌ

source: Monitor network requests that can slow or block your site.
am: ድረ-ገጽዎን ሊያዘገዩ ወይም ሊያግዱ የሚችሉ የአውታረ መረብ ጥያቄዎችን ይቆጣጠሩ።

source: Mozilla account
am: የMozilla መለያ

source: Mozilla accounts
am: የMozilla መለያዎች

source: MSI installers
am: MSI ማቀናጃዎች

source: Multiple languages
am: በርካታ ቋንቋዎች

source: Need help?
am: እርዳታ ይፈልጋሉ?

source: Network
am: አውታረ መረብ

source: New Tools
am: አዲስ መሣሪያዎች

source: No shady privacy policies or back doors for advertisers. Just a lightning fast browser that doesn’t sell you out.
am: ለአስተዋዋቂዎች ፍንጭ የሚሰጥ የግላዊነት መተዳደሪያ ወይም የኋላ በሮች የሉትም። እርስዎን የማይሸጥ መብረቅ የሆነ ፈጣን አሳሽ ብቻ።

source: Now finish <strong>installing</strong> { -brand-name-firefox }.
am: አሁን { -brand-name-firefox }ን <strong>መጫን</strong> ጨርስ።

source: Now <strong>open</strong> the file that just downloaded.
am: አሁን የወረደውን ፋይል <strong>ክፈት</strong>።

source: Now <strong>run</strong> the installer that just downloaded.
am: አሁን የወረደውን ጫኝ <strong>አስጀምር</strong>።

source: One easy way to check is to visit a browser’s content setting page and privacy policy. The privacy webpage should outline if your data is shared and why. It’s why the <a href="{ $privacy }">{ -brand-name-firefox } privacy notice</a> is easy to read and easy to find.
am: ለመፈተሽ አንዱ ቀላል መንገድ የአሳሹን የይዘት ቅንብር ገጽ እና የግላዊነት መመሪያ መጎብኘት ነው። የግላዊነት ድረ-ገጹ የእርስዎ ውሂብ ለሌሎች የተጋራ እንደሆነ እና ለምን እንደሆነ መግለጽ አለበት። ለዚህ ነው <a href="{ $privacy }">{ -brand-name-firefox } የግላዊነት ማሳሰቢያ</a> ለማንበብ ቀላል እና በቀላሉ ለማግኘት ቀላል የሆነው።

source: One tap to private mode
am: ወደ የግል ሁነታ አንድ ጊዜ መታ ያድርጉ

source: Open source
am: ክፍት ምንጭ

source: Own your home screen
am: የመነሻ ማያዎ ባለቤት ይሁኑ

source: Performance
am: አፈፃፀም

source: Pick up where you left off
am: ካቆሙበት ይቀጥሉ

source: Picture-in-Picture
am: ሥዕል-በሥዕል

source: Pinned Tabs
am: የተሰኩ ትሮች

source: Pin videos to your screen
am: ተንቀሳቃሽ ምስሎችን በማያ ገጽዎ ላይ ይሰኩ

source: Please download { -brand-name-firefox-esr } (Extended Support Release) to use { -brand-name-firefox }.
am: { -brand-name-firefox }ን ለመጠቀም እባክዎ { -brand-name-firefox-esr }ን (የተራዘመ የድጋፍ ልቀትን) ያውርዱ።

source: Please enter an email address.
am: እባክዎ የኢሜል አድራሻ ያስገቡ።

source: Please turn on JavaScript to display this page correctly.
am: ይህንን ገጽ በትክክል ለማሳየት እባክዎ JavaScriptን ያብሩት።

source: Policy documentation
am: የመመሪያ ሰነድ

source: Previous
am: ቀዳሚ

source: Previous { -brand-name-nightly } Builds
am: ቀዳሚ { -brand-name-nightly } ስሪቶች

source: Privacy comes first
am: ግላዊነት ይቀድማል

source: Privacy - more than a policy
am: ግላዊነት - ከመመሪያም በላይ

source: Privacy on the web is a hot button issue. If privacy is number one on your list of priorities, you want to look for a browser that takes that seriously. When choosing the best private browser for you, look at the tracking policy and how a browser handles your data. These seem like technical questions, but they’re the reason some browsers are more private than others.
am: የደህንነት ጉዳይ በበይነ-መረብ ላይ ዋና ቁልፍ ጉዳይ ነው። ደህንነት ትኩረት ከሚሰጡት ጉዳዮች አንዱ ከሆነ፤ ለዚህ ትኩረት የሚሰጡ ድረ-ገፆችን ማየት ይኖርብዎታል። የተሻለ ድረ-ገፅ ማሰሻ በሚመርጡበት ጊዜ፤ የመረጃ አያያዝ እና የሚከተሉትን ደንብና ፖሊሲ አስተውለህ ማየት አለብህ። ይኼ በርግጥ በጣም ቴክኒካል ጉዳይ ሊመስል ይችላል፤ ነገር ግን እነዚህ ነገሮች አንድ ድረ-ገፅ ማሰሻ ከሌላው የተሻለና ደህንነቱ የተጠበቀ መሆኑን መለያ መንገዶች ስለሆኑ ነው።

source: Privacy, speed, and security.
am: ግላዊነት፣ ፍጥነት እና ደህንነት።

source: Private Browsing mode
am: የግል አሰሳ ሁነታ

source: Protect your privacy
am: ግላዊነቶን ይከልሉ

source: Put { -brand-name-firefox } on all your devices
am: { -brand-name-firefox }ን በሁሉም መሳሪያዎችዎ ላይ ያድርጉ

source: Questions? <a { $attrs }>{ -brand-name-mozilla } support</a> has you covered.
am: ጥያቄዎች? <a { $attrs }>{ -brand-name-mozilla } ድጋፍ</a> ያግዝዎታል።

source: Reader mode
am: የአንባቢ ሁነታ

source: Related questions: does { -brand-name-firefox } hide your IP address
am: ተዛማጅ ጥያቄዎች፡- { -brand-name-firefox } የእርስዎን አይፒ አድራሻ ይደብቃልን

source: Related questions: is { -brand-name-firefox-browser } free, does { -brand-name-firefox } cost money
am: ተዛማጅ ጥያቄዎች፡- { -brand-name-firefox-browser } ነፃ ነውን፣ { -brand-name-firefox } ገንዘብ ያስወጣልን

source: Relay
am: ቅብብል

source: Release notes
am: የተለቀቀ ማስታወሻ

source: Release Notes
am: የመልቀቂያ ማስታወሻዎች

source: Remember the last massive data breach? If not, it’s probably because it happens so often. Companies hold on to customer data, like their personal or financial information, and hackers steal it. If you’re making safety a priority, then a secure internet browser is the best browser for you.
am: ለመጨረሻ ጊዜ የመረጃ መጭበርበር የደረሰብዎትን ጊዜ ያስታውሳሉ? ካልሆነ ምንአልባት ያላስታወሱት ይኼ ነገር ብዙ ጊዜ ይከሰታል ማለት ነው። ድርጅቶች የሚያስቀምጧቸው የደንበኞች የግል ሰነዶች እና ገንዘብ ነክ መረጃዎች የመሳሰሉት፤ ብዙ ጊዜ በጠላፊዎች ይሰርቃሉ። ለጥንቃቄ ቅድሚያ ከሰጡ ግን፤ ደህንነቱ የተጠበቀ የድረ-ገፅ ማሰሻ ምርጫዎት ይሆናል።

source: Replay
am: እንደገና አጫውት

source: Resources
am: መርጃዎች

source: Responsive Design Mode
am: ምላሽ ሰጪ ንድፍ ሁነታ

source: Return to top
am: ወደ ላይ ተመለስ

source: Review system requirements
am: የአሰራር ስርዓቱ የሚፈልገውን ይገምግሙ

source: Save power with Dark Mode
am: በጨለማ ሁነታ ኃይልን ይቆጥቡ

source: Scan the QR code to get { -brand-name-firefox-focus }
am: { -brand-name-firefox-focus }ን ለማግኘት የQR ኮዱን ይቃኙ

source: Scan the QR code to get { -brand-name-firefox } on { -brand-name-android }
am: በ{ -brand-name-android } ላይ { -brand-name-firefox }ን ለማግኘት የQR ኮዱን ይቃኙ

source: Scan the QR code to get { -brand-name-firefox } on { -brand-name-ios }
am: በ{ -brand-name-ios } ላይ { -brand-name-firefox }ን ለማግኘት የQR ኮዱን ይቃኙ

source: Scan the QR code to get started
am: ለመጀመር የQR ኮዱን ይቃኙ

source: Screenshots
am: ቅጽበታዊ ገጽ እይታዎች

source: Seamless setup
am: እንከን የለሽ ውቅር

source: Search engine options
am: የፍለጋ ፍርግም አማራጮች

source: Search from address bar
am: ከአድራሻ አሞሌ ይፈልጉ

source: Search from your phone’s home screen
am: ከስልክዎ መነሻ ገፅ ይፈልጉ

source: Search smarter, faster
am: በጥበብ፣ በፍጥነት ይፈልጉ

source: Search your own way
am: በራስዎ መንገድ ይፈልጉ

source: Secure your personal info
am: የግል መረጃዎን ያስጠብቁ

source: See all your open tabs, recent searches and favorite sites all in one place with { -brand-name-firefox } browser for { -brand-name-android }.
am: ሁሉንም ክፍት ትሮችዎን፣ የቅርብ ጊዜ ፍለጋዎችዎን እና ተወዳጅ ጣቢያዎችዎን ሁሉንም በአንድ ቦታ በ{ -brand-name-firefox } አሳሽ ለ{ -brand-name-android } ይመልከቱ።

source: See it all faster
am: ሁሉንም በፍጥነት ይመልከቱ

source: See something that isn’t working? Let us know.
am: የማይሰራ ነገር ተመለከቱ? አሳውቁን።

source: See your open tabs, past searches and favorite sites all in one place with { -brand-name-firefox-browser } for { -brand-name-ios }.
am: የእርስዎን ክፍት ትሮች፣ ያለፉ ፍለጋዎች እና ተወዳጅ ድረ-ገጾች ሁሉንም በ{ -brand-name-firefox-browser } ለ{ -brand-name-ios } በአንድ ቦታ ይመልከቱ።

source: See your protection report
am: የጥበቃ ሪፖርትዎን ይመልከቱ

source: Select your download
am: ማውረድዎን ይምረጡ

source: Select your preferred language
am: የሚፈልጉትን ቋንቋ ይምረጡ

source: Send
am: ላክ

source: Send a download link to your phone
am: የማውረጃ አገናኝ ወደ ስልክዎ ይላኩ።

source: Send a download link to your phone.
am: የማውረጃ አገናኝ ወደ ስልክዎ ይላኩ።

source: Send { -brand-name-firefox } to your smartphone or tablet
am: { -brand-name-firefox }ን ወደ ስማርት ስልክዎ ወይም ታብሌትዎ ይላኩ።

source: Send to another device
am: ወደ ሌላ መሳሪያ ላክ

source: Seriously private browsing. { -brand-name-firefox } automatically blocks 2000+ online trackers from collecting information about what you do online.
am: በቁም ነገር የግል አሰሳ። { -brand-name-firefox } ከ2000 በላይ የመስመር ላይ መከታተያዎች - እርስዎ በመስመር ላይ ስለሚያደርጉት ነገር መረጃ እንዳይሰበስቡ በራስ-ሰር ያግዳል።

source: Share
am: አጋራ

source: Share links
am: አገናኞችን አጋራ

source: Shortcut the internet with { -brand-name-firefox } for { -brand-name-android }
am: በይነመረብን በ{ -brand-name-firefox } ለ{ -brand-name-android } አቋራጭ

source: Show All
am: ሁሉንም አሳይ

source: Show Less
am: ያነሰ አሳይ

source: Show More
am: ተጨማሪ አሳይ

source: Sign up now
am: አሁን ይመዝገቡ

source: Simply private mobile browsing
am: በቀላሉ የግል ተንቀሳቃሽ አሰሳ

source: Smart search suggestions
am: ብልህ የፍለጋ ጥቆማዎች

source: So many ads, so little patience… It’s time to stop the madness.
am: ብዙ ማስታወቂያዎች ፣ ስለዚህ ትንሽ ትዕግስት… እብደትን ለማቆም ጊዜው አሁን ነው።
